# Homebrew Bundle manifest — the declarative list of Homebrew packages.
#   Install / sync:  brew bundle
#   Remove anything not listed here:  brew bundle cleanup
#   Update everything:  brew upgrade   (or `update` / topgrade)

# workspace + editor
brew "zellij"
brew "helix"

# file explorer + git UI
brew "yazi"
brew "lazygit"

# prompt + navigation + search
brew "starship"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "fd"

# task runner + reload-on-change
brew "just"
brew "watchexec"

# git tooling + nicer defaults
brew "gh"
brew "git-delta"
brew "bat"
brew "eza"

# one-command updater for the whole stack
brew "topgrade"
